Repository: adam-waldenberg/gitinspector
Catalog: gitinspector/translations/messages_*.po
Languages: nl, pt, ru, sk

source: gitinspector requires at least Python 2.6 to run (version {0} was found).
nl: gitinspector vereist minstens Python 2.6 om uitgevoert te kunnen worden (versie {0} gedetecteerd).
pt: gitinspector requer pelo menos o Python 2.6 para ser executado (versão {0} foi encontrada).
ru: gitinspector требует для запуска Python версии не ниже 2.6 (обнаружена версия {0})
sk: gitinspector vyžaduje aspoň verziu Python 2.6 (verzia {0} bola nájdená)

source: invalid regular expression specified
nl: ongeldige reguliere expressie gespecificieerd
pt: expressão regular inválida especificada
ru: указано неверное регулярное выражение
sk: zadaný nesprávný regulárny výraz

source: is mostly responsible for
nl: is grotendeels verantwoordelijk voor
pt: é principalmente responsável por
ru: больше всего ответственен за
sk: je väčšinou zodpovedný za

source: specified output format not supported.
nl: gespecificieerde output formaat niet ondersteund.
pt: formato de saída especificado não suportado.
ru: указанный формат вывода не поддерживается
sk: zadaný výstupný formát zatiaľ nie je podporovaný

source: {0} ({1:.3f} in cyclomatic complexity density)
nl: {0} ({1:.3f} in cyclomatische complexiteit dichtheid)
pt: {0} ({1:.3f} em densidade de complexidade ciclomática)
ru: {0} ({1:.3f} в плотности цикломатической сложности)
sk: {0} ({1:.3f} v zahustení cyklomatickej komplexnosti)

source: {0} ({1} estimated lines of code)
nl: {0} ({1} geschatte regels code)
pt: {0} ({1} linhas de código estimadas)
ru: {0} ({1} осталось строк кода)
sk: {0} ({1} odhadovných riadkov kódu)

source: {0} ({1} in cyclomatic complexity)
nl: {0} ({1} in cyclomatische complexiteit)
pt: {0} ({1} em complexidade ciclomática)
ru: {0} ({1} в цикломатической сложности)
sk: {0} ({1} v cyklomatickej komplexnosti)
