Repository: adam-waldenberg/gitinspector
Catalog: gitinspector/translations/messages_*.po
Languages: nl, pt, ru, sk

source: % in comments
nl: % in commentaren
pt: % nos comentários
ru: % комментариев
sk: % v komentároch

source: % of changes
nl: % in veranderingen
pt: % de mudanças
ru: % изменений
sk: % zmien

source: (extensions used during statistical analysis are marked)
nl: (extensies gebruikt tijdens de statistische analyse zijn gemarkeerd)
pt: (extensões usadas durante a análise estatística estão marcadas)
ru: (расширения используемые при статистическом анализе помечены)
sk: (rozšírenia použité počas štatistickej analýzy sú označené)

source: Age
nl: Leeftijd
pt: Idade
ru: Возраст
sk: Vek

source: Author
nl: Auteur
pt: Autor
ru: Автор
sk: Autor

source: Below are the number of rows from each author that have survived and are still intact in the current revision
nl: Hieronder is het aantal regels van elke auteur die bewaard zijn gebleven en nog steeds intact zijn in de huidige versie
pt: Abaixo estão o número de linhas de cada autor que sobreviveram e ainda estão intactas na revisão atual
ru: Ниже - количество строк от всех авторов, которые сохранились к текущей ревизии репозитория
sk: Nižšie je uvedený počet riadkov od každého autora, ktorý 'prežil' a je stále neporušený v aktuálnej revízii

source: Checking how many rows belong to each author (Progress): {0:.0f}%
nl: Aan het controleren hoeveel regels behoren tot elke auteur (voortgang): {0:.0f}%
pt: Verificando quantas linhas pertencem a cada autor (Progresso): {0:.0f}%
ru: Проверяем сколько строк принадлежит каждому автору (Прогресс): {0:.0f}%
sk: Kontrola počtu riadkov, ktoré patria každému autorovi

source: Commits
ru: Коммиты
sk: Komity

source: Copyright © 2012-2015 Ejwa Software. All rights reserved. License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>. This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law. Written by Adam Waldenberg.
nl: Copyright © 2012-2015 Ejwa Software. Alle rechten voorbehouden. License GPLv3+: GNU GPL versie 3 of hoger <http://gnu.org/licenses/gpl.html>. Dit programma is gratis software: je mag het herdistribueren en/of wijzigen. Er is GEEN GARANTIE, voor zover de wet dit toestaat. Geschreven door Adam Waldenberg.
pt: Direitos autorais © 2012-2015 Ejwa Software. Todos os direitos reservados. Licença GPLv3+: GNU GPL versão 3 ou posterior <http://gnu.org/licenses/gpl.html>. Este é um software livre: você pode modificá-lo e redistribuí-lo. Não há GARANTIA, até o limite permitido por lei. Escrito por Adam Waldenberg.
ru: Копирайт © 2012-2014 Ejwa Software. Все права защищены. Лицензия GPLv3+: GNU GPL версии 3 или старше <http://gnu.org/licenses/gpl.html>. Это открытое ПО: вы можете свободно менять и распространять его. нет НИКАКИХ ГАРАНТИЙ, в пределах, допускаемых законом. Создано Адамом Волденбергом.
sk: Copyright © 2012-2015 Ejwa Software. Všetky práva vyhradené. License GPLv3+: GNU GPL verzia 3 alebo neskôršia <http://gnu.org/licenses/gpl.html>. Jedná sa o slobodný software, môžete ho slobodne zmeniť a distribuovať. Neexistuje žiadna záruka v rozsahu povolenom zákonom. Vytvorené Adamom Waldenbergom.

source: Deletions
nl: Verwijderd
pt: Exclusões
ru: Удаления
sk: Odstránenia

source: Error processing git repository at "%s".
nl: Fout bij het afhandelen van de git repository op "%s".
pt: Erro ao processar o repositório git em "%s".
ru: Ошибка обработки git репозитория в "%s".
sk: Chyba pri spracovaní git úložiska na "%s".

source: HTML output not yet supported in
nl: HTML output nog niet ondersteund in
pt: Saída HTML ainda não suportada em
ru: HTML вывод еще не поддерживается
sk: HTML output zatiaľ nie je podporovaný

source: Hide minor authors
nl: Verberg minder belangrijke auteurs
pt: Ocultar autores menores
ru: Скрыть второстепенных авторов
sk: Skrytie menej značných autorov

source: Hide rows with minor work
nl: Verberg regels met minder werk
pt: Ocultar linhas com trabalho menor
ru: Скрыть строки с незначительными изменениями
sk: Skrytie riadkov s menej značnou prácou

source: Insertions
nl: Ingevoegd
pt: Inserções
ru: Вставки
sk: Vloženia

source: Minor Authors
nl: Minder belangrijke auteurs
pt: Autores Menores
ru: Второстепенные Авторы
sk: Menej znační autori

source: Modified Rows:
nl: Gewijzigde regels:
pt: Linhas Modificadas:
ru: Измененные строки:
sk: Upravené riadky

source: No commited files with the specified extensions were found
nl: Geen gecommitte bestanden met de gespecificeerde extensies werden gevonden
pt: Nenhum arquivo com commits e extensões especificadas foi encontrado
ru: Найдены незакоммиченные файлы с указанным расширением
sk: Nenašli sa žiadne vložené súbory so zadanými príponami

source: No metrics violations were found in the repository
nl: Geen metriek schendingen werden in de repository gevonden
pt: Nenhuma violação de métricas foi encontrada no repositório
ru: В репозитории не выявлено нарушений метрик
sk: V úložisku sa nenašli žiadne porušenia metrík

source: Repository statistics for {0}
nl: Repository statistieken voor {0}
pt: Estatísticas do repositório para {0}
ru: Статистика репозитория для {0}
sk: Štatistika úložiska pre {0}

source: Rows
nl: Regels
pt: Linhas
ru: Строки
sk: Riadky

source: Show minor authors
nl: Toon minder belangrijke auteurs
pt: Mostrar autores menores
ru: Показать второстепенных авторов
sk: Ukázať menej značných autorov

source: Show rows with minor work
nl: Toon regels met minder werk
pt: Mostrar linhas com trabalho menor
ru: Показать строки с незначительными изменениями
sk: Ukázať riadky s menej značnou prácou

source: Stability
nl: Stabiliteit
pt: Estabilidade
ru: Стабильность
sk: Stabilita

source: Statistical information for the repository '{0}' was gathered on {1}.
nl: Statistische informatie voor de repository '{0}' werd verzameld op {1}.
pt: Informações estatísticas para o repositório '{0}' foram coletadas em {1}.
ru: Статистическая информация для репозитория '{0}' была собрана на {1}.
sk: Štatistické informácie pre úložisko '{0}' sa zhromaždili na {1}

source: Text output not yet supported in
nl: Tekst output nog niet ondersteund in
pt: Saída de texto ainda não suportada em
ru: Тестовый формат вывода еще не поддерживается
sk: Textový výstup zatiaľ nie je podporovaný

source: The authors with the following emails were excluded from the statistics due to the specified exclusion patterns
nl: De auteurs met de volgende emails werden van de statistieken uitgesloten door de gespecificeerde uitsluitingspatronen
pt: Os autores com os seguintes e-mails foram excluídos das estatísticas devido aos padrões de exclusão especificados
ru: Авторы с указанной электронной почтой были исключены из статистики из-за указанных шаблонов исключений
sk: Autori s nasledujúcimi e-mailmi boli vylúčení zo štatistík z dôvodu špecifických vylučovacích vzorov.

source: The extensions below were found in the repository history
nl: De extensies hieronder werden in de repository geschiedenis gevonden
pt: As extensões abaixo foram encontradas no histórico do repositório
ru: Расширения ниже были найдены в истории репозитория
sk: Nižšie uvedené rozšírenia sa našli v histórii úložiska

source: The following authors were excluded from the statistics due to the specified exclusion patterns
nl: De volgende auteurs werden van de statistieken uitgesloten door de gespecificeerde uitsluitingspatronen
pt: Os seguintes autores foram excluídos das estatísticas devido aos padrões de exclusão especificados
ru: Следующие авторы были изъяты из статистики из-за указаных шаблонов исключения
sk: Nasledujúci autori boli vylúčení zo štatistík z dôvodu špecifických modelov vylúčenia

source: The following commit revisions were excluded from the statistics due to the specified exclusion patterns
nl: De volgende commit revisies werden van de statistieken uitgesloten door de gespecificeerde uitsluitingspatronen
pt: As seguintes revisões de commit foram excluídas das estatísticas devido aos padrões de exclusão especificados
ru: Следующие ревизии были изъяты из статистики из-за указаных шаблонов исключения
sk: Nasledujúce revízie komitov boli zo štatistiky vylúčené z dôvodu špecifických modelov vylúčenia

source: The following files are suspiciously big (in order of severity)
nl: De volgende bestanden zijn verdacht groot (in volgorde van grootte)
pt: Os seguintes arquivos são suspeitosamente grandes (em ordem de gravidade)
ru: Следующие файлы подозрительно большие(в размере)
sk: Nasledujúce súbory sú podozrivo veľké (podľa závažnosti)

source: The following files have an elevated cyclomatic complexity (in order of severity)
nl: De volgende bestanden hebben een verhoogde cyclomatische complexiteit (in volgorde van complexiteit)
pt: Os seguintes arquivos têm uma complexidade ciclomática elevada (em ordem de gravidade)
ru: Следующие файлы имеют увеличенную цикломатическую сложность (в порядке важности)
sk: Nasledujúce súbory majú zvýšenú cyklomatickú zložitosť (v poradí závažnosti)

source: The following files have an elevated cyclomatic complexity density (in order of severity)
nl: De volgende bestanden hebben een verhoogde cyclomatische complexiteit dichtheid (in volgorde van dichtheid)
pt: Os seguintes arquivos têm uma densidade de complexidade ciclomática elevada (em ordem de gravidade)
ru: Следующие файлы имеют увеличенную плотность цикломатической сложности (в порядке важности)
sk: Nasledujúce súbory majú zvýšenú hustotu cyklomatickej zložitosti (v poradí závažnosti)

source: The following files were excluded from the statistics due to the specified exclusion patterns
nl: De volgende bestanden werden van de statistieken uitgesloten door de gespecificeerde uitsluitingspatronen
pt: Os seguintes arquivos foram excluídos das estatísticas devido aos padrões de exclusão especificados
ru: Следующие файлы были изъяты из статистики из-за указаных шаблонов исключения
sk: Nasledujúce súbory boli zo štatistiky vylúčené z dôvodu špecifických modelov vylúčenia

source: The following historical commit information, by author, was found in the repository
nl: De volgende historische commit informatie, gegroepeerd op auteur, werd gevonden in de repository
pt: As seguintes informações históricas de commit, por autor, foram encontradas no repositório
ru: Следующая информация о коммите из истории, по автору, не найдена в репозитории
sk: Nasledujúce historické informácie o komite sa podľa autora našli v úložisku

source: The following history timeline has been gathered from the repository
nl: De volgende tijdlijn is uit de repository geschiedenis verzameld
pt: A seguinte linha do tempo histórica foi coletada do repositório
ru: Следующая хронология была собрана из репозитория
sk: Nasledujúca časová os bola zhromaždená z úložiska

source: The following responsibilities, by author, were found in the current revision of the repository (comments are excluded from the line count, if possible)
nl: De volgende verantwoordelijkheden, gegroepeerd op auteur, werden in de huidige revisie van de repository gevonden (commentaren zijn uitgesloten van de regeltelling, indien mogelijk)
pt: As seguintes responsabilidades, por autor, foram encontradas na revisão atual do repositório (comentários são excluídos da contagem de linhas, se possível)
ru: Следующие обязанности, по автору, были найдены в текущей ревизии репозитория (комментарии исключены из подсчета строк, где возможно)
sk: Následujúce povinnosti vypracované autorom, boli najdené v aktuálnej revízii úložiska (komenty sú vylúčené z počtu riadkov, ak je to možné)

source: The given option argument is not a valid boolean.
nl: De gegeven optie parameter is niet een geldige boolean.
pt: O argumento de opção fornecido não é um booleano válido.
ru: Переданный аргумент не является значением типа boolean
sk: Zadaný argument nie je platný boolovský.

source: The output has been generated by {0} {1}. The statistical analysis tool for git repositories.
nl: De output werd gegenereerd door {0} {1}. Het statistische analyse-instrument voor git repositories.
pt: A saída foi gerada por {0} {1}. A ferramenta de análise estatística para repositórios git.
ru: Вывод был сгенерирован {0} {1}. Утилитой для статистического анализа git репозиториев
sk: Výstup bol vygenerovaný {0} {1}. Nástroj štatistickej analýzy pre git úložiská.

source: Try `{0} --help' for more information.
nl: Probeer `{0} --help' voor meer informatie.
pt: Tente `{0} --help' para obter mais informações.
ru: Попробуйте `{0} --help' для более подробной информации
sk: Vyskúšajte '{0} --help' pre viac informácií.

source: Unable to determine absolute path of git repository.
nl: Kan het absolute pad van de git repository niet bepalen.
pt: Não foi possível determinar o caminho absoluto do repositório git.
ru: Невозможно определить абсолютный путь до git репозитория
sk: Nie je možné určiť absolútnu cestu git úložiska.

source: Usage: {0} [OPTION]... [REPOSITORY] List information about the repository in REPOSITORY. If no repository is specified, the current directory is used. If multiple repositories are given, information will be fetched from the last repository specified. Mandatory arguments to long options are mandatory for short options too. Boolean arguments can only be given to long options. -f, --file-types=EXTENSIONS a comma separated list of file extensions to include when computing statistics. The default extensions used are: {1} Specifying * includes files with no extension, while ** includes all files -F, --format=FORMAT define in which format output should be generated; the default format is 'text' and the available formats are: {2} --grading[=BOOL] show statistics and information in a way that is formatted for grading of student projects; this is the same as supplying the options -HlmrTw -H, --hard[=BOOL] track rows and look for duplicates harder; this can be quite slow with big repositories -l, --list-file-types[=BOOL] list all the file extensions available in the current branch of the repository -L, --localize-output[=BOOL] localize the generated output to the selected system language if a translation is available -m --metrics[=BOOL] include checks for certain metrics during the analysis of commits -r --responsibilities[=BOOL] show which files the different authors seem most responsible for --since=DATE only show statistics for commits more recent than a specific date -T, --timeline[=BOOL] show commit timeline, including author names --until=DATE only show statistics for commits older than a specific date -w, --weeks[=BOOL] show all statistical information in weeks instead of in months -x, --exclude=PATTERN an exclusion pattern describing the file paths, revisions, revisions with certain commit messages, author names or author emails that should be excluded from the statistics; can be specified multiple times -h, --help display this help and exit --version output version information and exit gitinspector will filter statistics to only include commits that modify, add or remove one of the specified extensions, see -f or --file-types for more information. gitinspector requires that the git executable is available in your PATH. Report gitinspector bugs to gitinspector@ejwa.se.
nl: Gebruik: {0} [OPTIE]... [REPOSITORY] Zet informatie over de repository in REPOSITORY. Als geen repository is gespecificieerd, word de huidige directory gebruikt. Als meer dan een repositories gegeven worden, zal de informatie van de laatst gespecificieerde repository opgehaald worden. Verplichte argumenten voor lange opties zijn ook voor korte opties verplicht. Boolean argumenten kunnen alleen voor lange opties worden gegeven. -f, --file-types=EXTENSIES een door komma's gesepareerde list van bestandsextensies om op te nemen bij het berekenen van de statistieken. De standaard extensies zijn: {1} Door * te specificeren worden bestanden met geen extensie opgenomen, en met ** worden alle bestanden opgenomen -F, --format=FORMAAT bepaal in welk formaat de output moet worden gegenereerd; het standaard formaat is 'text' en de formaten, die tot beschikking staan, zijn: {2} --grading[=BOOL] toon statistieken en informatie in een formaat geschikt voor de beoordeling van student projecten; dit is equivalent aan het optie- set -HlmrTw -H, --hard[=BOOL] spoor regels na en zoek intensiever naar duplicaten; dit kan best langzaam zijn voor grote repositories -l, --list-file-types[=BOOL] geef alle bestandsextensies ter beschikking in de huidige branch van de repository -L, --localize-output[=BOOL] localiseer de gegenereerde output tot de geselecteerde systeem taal, als hiervoor een vertaling beschikbaar is -m --metrics[=BOOL] voeg checks toe voor bepaalde metrieken tijdens de analyse van de commits -r --responsibilities[=BOOL] toon aan welke auteurs voor welke bestanden het meest verantwoordelijk lijken --since=DATUM laat alleen statistieken voor commits zien, die recenter zijn dan een specifiek datum -T, --timeline[=BOOL] toon commit tijdlijn, inclusief auteur namen --until=DATUM laat alleen statistieken voor commits zien, die ouder zijn dan een specifiek datum -w, --weeks[=BOOL] toon alle statistische informatie in weken in plaats van maanden -x, --exclude=PATROON een uitsluitingspatroon dat bestaat uit de bestand paden, revisies, revisies met bepaalde commit berichten, auteur namen of auteur emails die van de statistieken moeten worden uitgesloten; kan meer dan een keer gespecificeerd worden -h, --help toon dit hulpbericht en verlaat dit programma --version toon versie-informatie en verlaat dit programma gitinspector zal statistieken filteren om alleen commits te omvatten die een van de gespecificeerde extensies veranderen, toevoegen of verwijderen, zie -f of --file-types voor meer informatie. gitinspector vereist dat de git executable in de PATH variabele ter beschikking staat. Meld gitinspector bugs naar gitinspector@ejwa.se.
pt: Uso: {0} [OPÇÃO]... [REPOSITÓRIO] Lista informações sobre o repositório em REPOSITÓRIO. Se nenhum repositório for especificado, o diretório atual será usado. Se vários repositórios forem informados, as informações serão buscadas no último repositório especificado. Argumentos obrigatórios para opções longas também são obrigatórios para opções curtas. Argumentos booleanos só podem ser dados para opções longas. -f, --file-types=EXTENSÕES uma lista separada por vírgulas de extensões de arquivo para incluir ao calcular estatísticas. As extensões padrão usadas são: {1} Especificar * inclui arquivos sem extensão, enquanto ** inclui todos os arquivos -F, --format=FORMATO definir em qual formato a saída deve ser gerada; o formato padrão é 'text' e os formatos disponíveis são: {2} --grading[=BOOL] mostrar estatísticas e informações de forma formatada para avaliação de projetos de alunos; isso é o mesmo que fornecer as opções -HlmrTw -H, --hard[=BOOL] rastrear linhas e procurar por duplicatas de forma mais rigorosa; isso pode ser bastante lento com repositórios grandes -l, --list-file-types[=BOOL] listar todas as extensões de arquivo disponíveis no ramo atual do repositório -L, --localize-output[=BOOL] localizar a saída gerada para o idioma do sistema selecionado, se uma tradução estiver disponível -m --metrics[=BOOL] incluir verificações para determinadas métricas durante a análise de commits -r --responsibilities[=BOOL] mostrar em quais arquivos os diferentes autores parecem ser mais responsáveis --since=DATA mostrar apenas estatísticas para commits mais recentes que uma data específica -T, --timeline[=BOOL] mostrar a linha do tempo de commits, incluindo os nomes dos autores --until=DATA mostrar apenas estatísticas para commits mais antigos que uma data específica -w, --weeks[=BOOL] mostrar todas as informações estatísticas em semanas em vez de meses -x, --exclude=PADRÃO um padrão de exclusão descrevendo os caminhos dos arquivos, revisões, revisões com mensagens de commit específicas, nomes de autores ou e-mails de autores que devem ser excluídos das estatísticas; pode ser especificado várias vezes -h, --help exibir esta ajuda e sair --version exibir informações de versão e sair gitinspector filtrará as estatísticas para incluir apenas commits que modificam, adicionam ou removem uma das extensões especificadas. Consulte -f ou --file-types para obter mais informações. gitinspector requer que o executável git esteja disponível em seu PATH. Reporte bugs do gitinspector para gitinspector@ejwa.se.
sk: Využitie: {0} [MOŽNOSŤ]... [ÚLOŽISKO] Uveďte informácie o úložisku v ÚLOŽISKU. Ak nie je úložisko špecifikovaní, tak bude použité aktuálne úložisko. Ak je zadaných viacero úložisiek tak, informácie sa načítajú z posledného zadaného git úložiska. Povinné argumenty k predĺženým možnostiam sú povinné aj pre krátke možnosti. Boolovské argumenty môžu byť zadané iba pre predĺžené argumenty. -f, --file-types=EXTENSIONS zoznam prípon súborov oddelených čiarkou, ktorý bude zahrnutý do výpočtovej štatistiky. Použité predvolené rozšírenia sú: {1} Zadaním * zahŕňame súbory bez prípony, zatiaľ čo použitím ** zahŕňame všetky súbory, ktoré -F, --format=FORMAT definujú v akom formáte bude vygenerovaný výstup Predvolený formát je 'text' a dostupné formáty sú: {2} --grading[=BOOL] zobraziť štatistiky a informácie spôsobom, ktorý je formátovaný na klasifikáciu študentských projektov; je to rovnaké ako poskytovanie možností -HlmrTw -H, --hard[=BOOL] sledovať riadky a hladať duplikáty s väčším úsilím; toto môže byť veľmi časovo náročné s veľkými úložiskami -l, --list-file-types[=BOOL] vypísať zoznam všetkých prípon súborov dostupných v aktuálnej vetve úložiska -L, --localize-output[=BOOL] lokalizovať vygenerovaný output do vybratého systémového jazyka, ak je preklad k dispozícii -m --metrics[=BOOL] zahŕňať kontroly určitých metrík počas analýzy komitov -r --responsibilities[=BOOL] zobraziť súbory, za ktoré sa rôzni autori zdajú byť najviac zodpovední --since=DATE zobrazovať iba štatistiky komitov, ktoré sú novšie ako určený dátum -T, --timeline[=BOOL] zobraziť časovú os komitov vrátane mien autorov --until=DATE zobrazovať iba štatistiky komitov štaršie ako zadaný dátum -w, --weeks[=BOOL] zobraziť všeky štatistické informácie v týždňoch namiesto v mesiacoch -x, --exclude=PATTERN vzorka vylúčenia popisujúca cesty súvorov, revízie, revízie s určitými komit správami, mena autorov alebo autorské emaily, ktoré by mali byť vylúčené zo štatistík; je možné zadať viackrát -h, --help zobraziť pomocník a ukončiť --version informácie o výstupovej verzii a ukončiť gitinspector bude filtrovať štatistiky tak, aby zahŕňali iba komity, ktoré upravujú pridávajú alebo odstraňujú jednu zo zadaných rozšírení, pozri -f alebo --file-types pre viac informácií. gitinspector vyžaduje, aby spustiteľný súbor git bol k dispozícii vo vašom PATH. Nahlasovanie gitinspector bugov na: gitinspector@ejwa.se.

source: WARNING: The terminal encoding is not correctly configured. gitinspector might malfunction. The encoding can be configured with the environment variable 'PYTHONIOENCODING'.
nl: WAARSCHUWING: De terminal codering is niet correct geconfigureerd. Storingen zouden kunnen optreden bij het uitvoeren van gitinspector. De codering kan geconfigureerd worden met de omgevingsvariabele 'PYTHONIOENCODING'.
pt: AVISO: A codificação do terminal não está configurada corretamente. O gitinspector pode apresentar mau funcionamento. A codificação pode ser configurada com a variável de ambiente 'PYTHONIOENCODING'.
ru: ПРЕДУПРЕЖДЕНИЕ: Кодировка терминала некорректно настроена. gitinspector может не функционировать. Кодировка может быть настроена с помощью переменной окружения 'PYTHONIOENCODING'.
sk: VAROVANIE: Kódovanie terminálu nie je správne nakonfigurované. gitinspector môže zlyhať. Kódovanie je možné nakonfigurovať pomocou premennej prostredia 'PYTHONIOENCODING'.

source: XML output not yet supported in
nl: XML output nog niet ondersteund in
pt: Saída XML ainda não suportada em
ru: XML формат вывода еще не поддерживается
sk: XML output zatiaľ nie je podporovaný
